Revit 2024 API
ParameterTypeId.ConnectorDiameter Property
 "Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ConnectorDiameter { get; }
Visual Basic
Public Shared ReadOnly Property ConnectorDiameter As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ConnectorDiameter {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace